import './style.scss';
import './media.scss';

class Greeting {
  element = document.createElement('section');
  constructor() {
    this.element.classList.add('greeting');
    this.addContent();
  }
  addContent() {
    this.element.innerHTML = `
      <div class="greeting-wrapper">
      <div class="container-greeting">
        <span class="greeting-wrapper-span">yachting</span>
      </div>
      <svg class="greeting-wrapper-svg" width="378" height="378" fill="none" xmlns="http://www.w3.org/2000/svg">
        <g clip-path="url(#a)" fill="#fff" fill-opacity=".5">
          <path
            d="M189.292 0h-.584v2.917h.584V0ZM219.069 1.786l-.467 2.887.578.094.466-2.888-.577-.093ZM247.127 9.16l-.901 2.775.555.18.901-2.774-.555-.18ZM274.543 20.464l-1.324 2.599.52.264 1.324-2.598-.52-.265ZM300.557 35.709l-1.72 2.362.472.345 1.721-2.363-.473-.344ZM322.437 55.157l-2.062 2.063.412.412 2.063-2.062-.413-.413ZM341.737 77.672l-2.36 1.715.343.471 2.359-1.714-.342-.472ZM357.27 102.936l-2.599 1.324.265.52 2.599-1.325-.265-.519ZM368.656 130.317l-2.774.901.18.555 2.774-.902-.18-.554ZM375.626 159.149l-2.881.456.091.576 2.881-.456-.091-.576ZM378 188.708h-2.917v.584H378v-.584ZM372.837 217.82l-.091.576 2.881.456.091-.576-2.881-.456ZM366.067 246.229l-.181.555 2.774.901.181-.555-2.774-.901ZM354.935 273.218l-.265.519 2.599 1.324.265-.519-2.599-1.324ZM339.715 298.139l-.343.472 2.359 1.714.343-.472-2.359-1.714ZM320.783 320.372l-.412.412 2.062 2.063.413-.413-2.063-2.062ZM298.609 339.374l-.472.343 1.715 2.359.472-.342-1.715-2.36ZM273.741 354.668l-.519.265 1.324 2.598.52-.264-1.325-2.599ZM246.779 365.88l-.555.18.901 2.774.555-.18-.901-2.774ZM218.396 372.746l-.576.091.456 2.881.577-.092-.457-2.88ZM189.292 375.083h-.584V378h.584v-2.917ZM159.604 372.745l-.457 2.881.577.091.456-2.881-.576-.091ZM131.218 365.884l-.901 2.774.554.18.902-2.774-.555-.18ZM104.26 354.669l-1.324 2.599.52.265 1.324-2.599-.52-.265ZM79.386 339.37l-1.714 2.36.472.343 1.714-2.36-.472-.343ZM57.213 320.368l-2.062 2.062.412.413 2.063-2.063-.413-.412ZM38.285 298.141l-2.36 1.714.343.472 2.36-1.714-.343-.472ZM23.069 273.224l-2.6 1.324.266.52 2.599-1.324-.265-.52ZM11.937 246.228l-2.774.901.18.555 2.774-.901-.18-.555ZM5.164 217.82l-2.88.457.09.576 2.882-.457-.092-.576ZM2.917 188.708H0v.584h2.917v-.584ZM2.374 159.146l-.091.576 2.88.457.092-.576-2.881-.457ZM9.338 130.314l-.18.555 2.774.901.18-.555-2.774-.901ZM20.73 102.935l-.265.519 2.599 1.325.265-.52-2.599-1.324ZM36.267 77.676l-.343.472 2.36 1.714.343-.472-2.36-1.714ZM55.567 55.153l-.412.413 2.062 2.062.413-.412-2.063-2.063ZM78.304 35.782l-.473.345 1.721 2.362.473-.344-1.721-2.363ZM103.453 20.467l-.52.264 1.324 2.6.52-.266-1.324-2.598ZM130.873 9.161l-.554.18.901 2.774.555-.18-.902-2.774ZM159.725 2.284l-.577.091.457 2.88.576-.09-.456-2.881Z"
          />
          <path d="M189.292 0h-.584v2.917h.584V0Z" />
        </g>
        <defs>
          <clipPath id="a"><path fill="#fff" d="M0 0h378v378H0z" /></clipPath>
        </defs>
      </svg>
      <div class="greeting-wrapper__block">
        <h2 class="greeting-wrapper__title">
          <span class="greeting-wrapper__title-gray">Выберите</span> вашу новую яхту
        </h2>
      </div>
      <h3 class="greeting-wrapper__description">
        Ищите, сравнивайте и покупайте лодки с помощью нашего каталого и проверенных экспертов
      </h3>
      <div class="panel__button-wrapper panel__button-wrapper-greeting">
        <div class="panel__button-absolute panel__button-absolute-visible">найти</div>
        <div class="panel__button-absolute panel__button-absolute-hidden">найти</div>
        <button class="panel__button panel__button-greeting">
          <svg class="panel__button-border" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M5.768.5H209.42c2.393 0 4.13 2.367 3.473 4.7-1.46 5.18-3.392 13.183-3.392 19.3 0 6.117 1.932 14.12 3.392 19.3.657 2.333-1.08 4.7-3.473 4.7H5.769c-2.44 0-4.189-2.454-3.459-4.816C3.91 38.51 6 30.595 6 24.5c0-6.095-2.09-14.009-3.69-19.184C1.58 2.954 3.33.5 5.768.5Z"
            />
          </svg>
        </button>
      </div>
    </div>
    `;
  }
}
export default Greeting;
